{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "84\n",
      "Угадайте число от 1 до 100: 50\n",
      "Загаданное число больше.\n",
      "Попробуйте снова: 60\n",
      "Загаданное число больше.\n",
      "Попробуйте снова: 70\n",
      "Загаданное число больше.\n",
      "Попробуйте снова: 80\n",
      "Загаданное число больше.\n",
      "Попробуйте снова: 90\n",
      "Загаданное число меньше.\n",
      "Попробуйте снова: 95\n",
      "Загаданное число меньше.\n",
      "Попробуйте снова: 93\n",
      "Загаданное число меньше.\n",
      "Попробуйте снова: 83\n",
      "Загаданное число больше.\n",
      "Попробуйте снова: 84\n",
      "Поздравляю! Вы угадали число  84 !\n"
     ]
    }
   ],
   "source": [
    "# 2024.01.04 HW 6 \n",
    "'''\n",
    "1 Напишите программу, которая генерирует случайное число от 1 до 100, а затем предлагает\n",
    "пользователю угадать это число. Если пользователь угадывает число, программа выводит\n",
    "сообщение о победе. Если пользователь не угадывает число, программа сообщает, больше или\n",
    "меньше загаданное число и предлагает попробовать снова. Используйте цикл с инструкцией\n",
    "break, чтобы остановить выполнение цикла, когда число угадано.\n",
    "'''\n",
    "import random\n",
    "\n",
    "x = random.randint(1,100)\n",
    "#print(x)\n",
    "number = int(input('Угадайте число от 1 до 100: '))\n",
    "\n",
    "while True:        \n",
    "    if x == number:\n",
    "        print('Поздравляю! Вы угадали число ', number, '!' )\n",
    "        break\n",
    "    elif x > number:\n",
    "        print('Загаданное число больше.' )\n",
    "    elif x < number:\n",
    "        print('Загаданное число меньше.' )  \n",
    "    \n",
    "    number = int(input('Попробуйте снова: '))    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число N:7\n",
      "Первые 7 чисел Фибоначчи: 0,1,1,2,3,5,8\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "2 Напишите программу, которая запрашивает у пользователя число N и выводит первые N чисел\n",
    "Фибоначчи. Числа Фибоначчи - это последовательность чисел, где каждое следующее число\n",
    "является суммой двух предыдущих чисел (начиная с 0 и 1). Используйте цикл while для решения\n",
    "задачи. Выведите числа через запятую с помощью команды print.\n",
    "\n",
    "'''\n",
    "def Fib(n):\n",
    "    if n == 0 or n == 1: return n\n",
    "    else: return Fib(n-1) + Fib(n-2) \n",
    "\n",
    "number = int(input('Введите число N:'))\n",
    "print(f'Первые {number} чисел Фибоначчи: ' , end = '')\n",
    "\n",
    "for i in range(number):\n",
    "    if i < number-1: print(f'{Fib(i)},', end = '')\n",
    "    elif i == number-1: print(f'{Fib(i)}' )     "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите целое положительное число:25\n",
      "Число 25 не является простым.\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "3 Напишите программу, которая запрашивает у пользователя целое положительное число и\n",
    "проверяет, является ли оно простым. Простое число - это число, которое делится только на 1 и\n",
    "на само себя без остатка. Используйте цикл while и проверку деления числа на все числа от 2 до\n",
    "N-1 для решения задачи. Выведите соответствующее сообщение на экран с помощью команды\n",
    "print.\n",
    "'''\n",
    "\n",
    "number = int(input('Введите целое положительное число:'))\n",
    "\n",
    "d = 2\n",
    "while True:\n",
    "    if number%d == 0:\n",
    "        print(f'Число {number} не является простым.')\n",
    "        break\n",
    "    else:   \n",
    "        d += 1\n",
    "    if d == number:\n",
    "        print(f'Число {number} является простым.')\n",
    "        break\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
