{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " полезно и интересно это Программирование \n"
     ]
    }
   ],
   "source": [
    "# 2024.02.01 HW 14\n",
    "''' 1. Напишите программу, которая принимает строку от пользователя и\n",
    "разбивает ее на отдельные слова. Затем программа должна объединить\n",
    "слова в обратном порядке с использованием метода join(). \n",
    "Используйте динамический массив и методы для работы со строками. \n",
    "Выведите результат на экран с помощью команды print.\n",
    "Пример вывода:\n",
    "Введите предложение: Программирование это интересно и полезно\n",
    "Перевернутое предложение: полезно и интересно это Программирование '''\n",
    "def func():\n",
    "    # Программирование это интересно и полезно\n",
    "    string = input('Введите предложение: ').split()[::-1]\n",
    "    string = (' ').join(string)\n",
    "    print(f' {string} ')    \n",
    "\n",
    "func()   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Динамический массив: [3, 5, 6, 8, 9] \n"
     ]
    }
   ],
   "source": [
    "''' 2. Напишите программу, которая принимает список чисел от пользователя и \n",
    "добавляет каждое число в динамический массив. \n",
    "Затем программа должна принимать новое число от пользователя и \n",
    "добавлять его в динамический массив до тех пор, \n",
    "пока пользователь не введет команду \"Выход\". \n",
    "Используйте метод append() для добавления элементов в динамический массив и \n",
    "условный оператор для проверки команды \"Выход\". \n",
    "Выведите итоговый динамический массив на экран с помощью команды print.\n",
    "Пример вывода: Введите число (или 'Выход' для завершения): 1\n",
    "               Введите число (или 'Выход' для завершения): 2\n",
    "               Введите число (или 'Выход' для завершения): Выход\n",
    "Динамический массив: [1, 2]    '''\n",
    "\n",
    "def func():\n",
    "    data = []\n",
    "    number = int(input(\"Введите число (или 'Выход' для завершения): \"))\n",
    "\n",
    "    while number != 'Выход':    \n",
    "        data.append(int(number))\n",
    "        number = input(\"Введите число (или 'Выход' для завершения): \")  \n",
    "    return data\n",
    "\n",
    "data = func()\n",
    "print(f'Динамический массив: {data } ')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
