{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Число не является палиндромом.\n"
     ]
    }
   ],
   "source": [
    "# 2024.01.11 HW 8 \n",
    "'''1. Напишите программу, которая запрашивает у пользователя \n",
    "целое число и определяет, является ли оно палиндромом. \n",
    "Число является палиндромом, если оно\n",
    "читается одинаково слева направо и справа налево. \n",
    "Выведите соответствующее сообщение на экран с помощью команды print. \n",
    "Используйте математические операции. \n",
    "Работу со строками использовать нельзя.\n",
    "Пример вывода: Введите целое число: 12321\n",
    "Число является палиндромом.'''\n",
    "\n",
    "x1 = x0 = x = int(input('Введите целое число: '))\n",
    "\n",
    "l = 0 \n",
    "while x0 > 0:\n",
    "    l = l + 1\n",
    "    x0 = x0 // 10\n",
    "\n",
    "y = 0\n",
    "while x1 > 0:\n",
    "    n = x1 % 10\n",
    "    y = y * 10 + n\n",
    "    x1 = x1 // 10    \n",
    "     \n",
    "if x == y: print('Число является палиндромом.')\n",
    "else: print('Число не является палиндромом.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите целое число: 344\n",
      " Число не является числом Армстронга. \n"
     ]
    }
   ],
   "source": [
    "'''2. Напишите программу, которая запрашивает у пользователя целое число и проверяет,\n",
    "является ли оно числом Армстронга. Число Армстронга - это число, которое равно сумме\n",
    "своих цифр, возведенных в степень, равную количеству цифр в числе.\n",
    "Выведите соответствующее сообщение на экран с помощью команды print.\n",
    "Пример вывода:\n",
    "Введите целое число: 153\n",
    "Число является числом Армстронга.'''\n",
    "\n",
    "x2 = x1 = x =int(input('Введите целое число: '))\n",
    "\n",
    "l = 0 \n",
    "while x1 > 0:\n",
    "    l = l + 1\n",
    "    x1 = x1 // 10\n",
    "\n",
    "summa = 0\n",
    "while x > 0:\n",
    "    summa = summa +  (x%10)**l\n",
    "    x //= 10\n",
    "    \n",
    "if x2 == summa:\n",
    "    print(f' Число является числом Армстронга. ')\n",
    "else:\n",
    "    print(f' Число не является числом Армстронга. ')    \n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
