{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "c222dc11",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите натуральное десятичное число: 10\n",
      "Двоичное представление числа: 1010\n"
     ]
    }
   ],
   "source": [
    "# 2024.01.08 HW 7\n",
    "'''\n",
    "1 Напишите программу, которая запрашивает у пользователя натуральное десятичное число и \n",
    "выводит его двоичное представление. \n",
    "Реализуйте алгоритм перевода числа в двоичную систему счисления, \n",
    "используя основные концепции представления чисел (подсказка: через деление с остатком). \n",
    "Выведите полученное представление числа на экран.\n",
    "\n",
    "Введите натуральное десятичное число: 123\n",
    "Двоичное представление числа: 1111011\n",
    "'''\n",
    "x = int(input('Введите натуральное десятичное число: '))\n",
    "xbin = ''\n",
    "while x > 0:\n",
    "    xbin = str(x%2) + xbin\n",
    "    x = x// 2\n",
    "else:\n",
    "    print(f'Двоичное представление числа: {xbin }')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "bdd527a7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Округленное значение: 0\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "2 Напишите программу, принимающую число с плавающей точкой и \n",
    "округляющую его до целого числа в соответствии с правилами школьной математики. \n",
    "Использовать модуль math и методы из него нельзя. \n",
    "Учесть, что программа должна корректно работать с отрицательными числами.\n",
    "\n",
    "Пример вывода:\n",
    "Введите вещественное число: -3.14\n",
    "Округленное значение: -3\n",
    "'''\n",
    "x = float(input('Введите вещественное число: '))\n",
    "if x >= 0:\n",
    "    x1 = int(x+0.5)\n",
    "elif x < 0:\n",
    "    x1 = int(x-0.5) \n",
    "print(f'Округленное значение: {x1 }')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
