# 15 task 1
# Элементами множеств А, P, Q являются натуральные числа,
# P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20},
# Q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}.
# Известно, что выражение
# ((x ∈ P) → (x ∈ A)) ∨ (¬(x ∈ A) → ¬(x ∈ Q))
# истинно (т. е. принимает значение 1) при любом значении
# переменной х. 
# Определите наименьшее возможное значение
# суммы элементов множества A.

p = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}
q = {3, 6, 9, 12, 15, 18, 21, 24, 27, 30}
arr = []
f = False
for x in range(1, min( max(p), max(q) )+1):
    f = False
    # ((x ∈ P) → (x ∈ A)) ∨ (¬(x ∈ A) → ¬(x ∈ Q))
    f += (x not in p) or (x not in q) #or (x == a)    
    print('x=', x, 'f=', f)
    if f == True :
         if x not in arr: arr.append(x)
         print('x=', x, 'f=', f)
        
print('(arr)=', (arr), '\n', 'len(arr)=', len(arr))
# (arr)= [1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 19, 20] 
# len(arr)= 17
